import { object, string, number } from "yup";

const validator = object({
  length: number().required("طول الزامی است.").min(300, "طول باید حداقل 300 میلی‌متر باشد.").max(700, "طول باید حداکثر 700 میلی‌متر باشد."),
  width: number().required("عرض الزامی است.").min(100, "عرض باید حداقل 100 میلی‌متر باشد.").max(500, "عرض باید حداکثر 500 میلی‌متر باشد."),
  height: number().required("ارتفاع الزامی است.").min(300, "ارتفاع باید حداقل 300 میلی‌متر باشد.").max(800, "ارتفاع باید حداکثر 800 میلی‌متر باشد."),
  weight: number().required("وزن الزامی است.").min(4000, "وزن باید حداقل 4000 گرم باشد.").max(30000, "وزن باید حداکثر 30000 گرم باشد."),
  motherboard: string().required("مادربرد الزامی است.").min(2, "مادربرد باید حداقل 2 کاراکتر باشد.").max(20, "مادربرد باید حداکثر 20 کاراکتر باشد."),
  CPU: string().required("سازنده پردازنده الزامی است.").oneOf(["Intel", "AMD"], "سازنده پردازنده باید Intel یا AMD باشد."),
  CPUSeries: string().required("سری پردازنده الزامی است.").min(1, "سری پردازنده باید حداقل 1 کاراکتر باشد.").max(50, "سری پردازنده باید حداکثر 50 کاراکتر باشد."),
  CPUGeneration: string().required("نسل پردازنده الزامی است.").min(5, "نسل پردازنده باید حداقل 5 کاراکتر باشد.").max(50, "نسل پردازنده باید حداکثر 50 کاراکتر باشد."),
  CPUFrequency: number().required("فرکانس پردازنده الزامی است.").min(1, "فرکانس پردازنده باید حداقل 1 گیگاهرتز باشد.").max(10, "فرکانس پردازنده باید حداکثر 10 گیگاهرتز باشد."),
  CPUCore: number().required("تعداد هسته پردازنده الزامی است.").min(2, "تعداد هسته پردازنده باید حداقل 2 عدد باشد.").max(20, "تعداد هسته پردازنده باید حداکثر 20 عدد باشد."),
  GPU: string().required("سازنده پردازنده گرافیکی الزامی است.").oneOf(["Intel", "AMD", "NVIDIA"], "سازنده پردازنده گرافیکی باید Intel، AMD یا NVIDIA باشد."),
  GPUModel: string().required("مدل پردازنده گرافیکی الزامی است.").min(5, "مدل پردازنده گرافیکی باید حداقل 5 کاراکتر باشد.").max(50, "مدل پردازنده گرافیکی باید حداکثر 50 کاراکتر باشد."),
  GPURAM: number().required("رم پردازنده گرافیکی الزامی است.").min(2, "رم پردازنده گرافیکی باید حداقل 2 گیگابایت باشد.").max(30, "رم پردازنده گرافیکی باید حداکثر 30 گیگابایت باشد."),
  operatingSystem: string().required("سیستم عامل الزامی است.").oneOf(["Windows", "فاقد سیستم عامل"], "سیستم عامل باید Windows یا فاقد سیستم عامل باشد."),
  operatingSystemVersion: number().oneOf([10, 11], "نسخه سیستم عامل باید 10 یا 11 باشد."),
  internalMemory: number().required("حافظه داخلی الزامی است.").oneOf([128, 256, 512, 1024, 2048], "حافظه داخلی باید 128، 256، 512، 1024 یا 2048 گیگابایت باشد."),
  internalMemoryType: string().required("نوع حافظه داخلی الزامی است.").oneOf(["HDD", "SSD"], "نوع حافظه داخلی باید HDD یا SSD باشد."),
  RAM: number().required("رم الزامی است.").min(2, "رم باید حداقل 2 گیگابایت باشد.").max(128, "رم باید حداکثر 128 گیگابایت باشد."),
  RAMType: string().required("نوع رم الزامی است.").oneOf(["DDR3", "DDR4", "DDR5"], "نوع رم باید DDR3، DDR4 یا DDR5 باشد."),
});

export default validator;