import { object, string, number, boolean } from "yup";

const validator = object({
  length: number().required("طول الزامی است.").min(300, "طول باید حداقل 300 میلی‌متر باشد.").max(500, "طول باید حداکثر 500 میلی‌متر باشد."),
  width: number().required("عرض الزامی است.").min(200, "عرض باید حداقل 200 میلی‌متر باشد.").max(500, "عرض باید حداکثر 500 میلی‌متر باشد."),
  thickness: number().required("ضخامت الزامی است.").min(10, "ضخامت باید حداقل 10 میلی‌متر باشد.").max(30, "ضخامت باید حداکثر 30 میلی‌متر باشد."),
  weight: number().required("وزن الزامی است.").min(1000, "وزن باید حداقل 1000 گرم باشد.").max(3000, "وزن باید حداکثر 3000 گرم باشد."),
  motherboard: string().required("مادربرد الزامی است.").min(2, "مادربرد باید حداقل 2 کاراکتر باشد.").max(20, "مادربرد باید حداکثر 20 کاراکتر باشد."),
  CPU: string().required("سازنده پردازنده الزامی است.").oneOf(["Intel", "AMD", "Apple"], "سازنده پردازنده باید Intel، AMD یا Apple باشد."),
  CPUSeries: string().required("سری پردازنده الزامی است.").min(1, "سری پردازنده باید حداقل 1 کاراکتر باشد.").max(50, "سری پردازنده باید حداکثر 50 کاراکتر باشد."),
  CPUGeneration: string().required("نسل پردازنده الزامی است.").min(5, "نسل پردازنده باید حداقل 5 کاراکتر باشد.").max(50, "نسل پردازنده باید حداکثر 50 کاراکتر باشد."),
  CPUFrequency: number().required("فرکانس پردازنده الزامی است.").min(1, "فرکانس پردازنده باید حداقل 1 گیگاهرتز باشد.").max(10, "فرکانس پردازنده باید حداکثر 10 گیگاهرتز باشد."),
  CPUCore: number().required("تعداد هسته پردازنده الزامی است.").min(2, "تعداد هسته پردازنده باید حداقل 2 عدد باشد.").max(20, "تعداد هسته پردازنده باید حداکثر 20 عدد باشد."),
  GPU: string().required("سازنده پردازنده گرافیکی الزامی است.").oneOf(["Intel", "AMD", "NVIDIA", "Apple"], "سازنده پردازنده گرافیکی باید Intel، AMD، NVIDIA یا Apple باشد."),
  GPUModel: string().required("مدل پردازنده گرافیکی الزامی است.").min(5, "مدل پردازنده گرافیکی باید حداقل 5 کاراکتر باشد.").max(50, "مدل پردازنده گرافیکی باید حداکثر 50 کاراکتر باشد."),
  GPURAM: number().required("رم پردازنده گرافیکی الزامی است.").min(2, "رم پردازنده گرافیکی باید حداقل 2 گیگابایت باشد.").max(30, "رم پردازنده گرافیکی باید حداکثر 30 گیگابایت باشد."),
  operatingSystem: string().required("سیستم عامل الزامی است.").oneOf(["Windows", "MacOS", "فاقد سیستم عامل"], "سیستم عامل باید Windows، MacOS یا فاقد سیستم عامل باشد."),
  operatingSystemVersion: number().min(10, "نسخه سیستم عامل باید حداقل 10 باشد.").max(15, "نسخه سیستم عامل باید حداکثر 15 باشد."),
  internalMemory: number().required("حافظه داخلی الزامی است.").oneOf([128, 256, 512, 1024, 2048], "حافظه داخلی باید 128، 256، 512، 1024 یا 2048 گیگابایت باشد."),
  internalMemoryType: string().required("نوع حافظه داخلی الزامی است.").oneOf(["HDD", "SSD"], "نوع حافظه داخلی باید HDD یا SSD باشد."),
  RAM: number().required("رم الزامی است.").min(2, "رم باید حداقل 2 گیگابایت باشد.").max(128, "رم باید حداکثر 128 گیگابایت باشد."),
  RAMType: string().required("نوع رم الزامی است.").oneOf(["DDR3", "DDR4", "DDR5"], "نوع رم باید DDR3، DDR4 یا DDR5 باشد."),
  screen: string().required("نوع صفحه نمایش الزامی است.").min(3, "نوع صفحه نمایش باید حداقل 3 کاراکتر باشد.").max(50, "نوع صفحه نمایش باید حداکثر 50 کاراکتر باشد."),
  screenSize: number().required("اندازه صفحه نمایش الزامی است.").min(10, "اندازه صفحه نمایش باید حداقل 10 اینچ باشد.").max(20, "اندازه صفحه نمایش باید حداکثر 20 اینچ باشد."),
  resolutionWidth: number().required("عرض رزولوشن الزامی است.").min(500, "عرض رزولوشن باید حداقل 500 پیکسل باشد.").max(10000, "عرض رزولوشن باید حداکثر 10000 پیکسل باشد."),
  resolutionHeight: number().required("ارتفاع رزولوشن الزامی است.").min(500, "ارتفاع رزولوشن باید حداقل 500 پیکسل باشد.").max(10000, "ارتفاع رزولوشن باید حداکثر 10000 پیکسل باشد."),
  battery: string().required("باطری الزامی است.").min(5, "باطری باید حداقل 5 کاراکتر باشد.").max(50, "باطری باید حداکثر 50 کاراکتر باشد."),
  batteryCapacity: number().required("ظرفیت باطری الزامی است.").min(30, "ظرفیت باطری باید حداقل 30 میلی‌آمپر باشد.").max(150, "ظرفیت باطری باید حداکثر 150 میلی‌آمپر باشد."),
  hasFingerprintSensor: boolean().required("وضعیت حسگر اثرانگشت الزامی است."),
});

export default validator;