import { object, string, number, boolean } from "yup";

const validator = object({
  weight: number().required("وزن الزامی است.").min(30, "وزن باید حداقل 30 گرم باشد.").max(500, "وزن باید حداکثر 500 گرم باشد."),
  strapMaterial: string().required("جنس بند الزامی است.").min(3, "جنس بند باید حداقل 3 کاراکتر باشد.").max(50, "جنس بند باید حداکثر 50 کاراکتر باشد."),
  chip: string().required("تراشه الزامی است.").min(5, "تراشه باید حداقل 5 کاراکتر باشد.").max(100, "تراشه باید حداکثر 100 کاراکتر باشد."),
  operatingSystem: string().required("سیستم عامل الزامی است.").oneOf(["WearOS", "WatchOS", "Tizen"], "سیستم عامل باید WearOS، WatchOS یا Tizen باشد."),
  operatingSystemVersion: number().required("نسخه سیستم عامل الزامی است.").min(3, "نسخه سیستم عامل باید حداقل 3 باشد.").max(10, "نسخه سیستم عامل باید حداکثر 10 باشد."),
  internalMemory: number().required("حافظه داخلی الزامی است.").oneOf([16, 32, 64, 128, 256], "حافظه داخلی باید 16، 32، 64، 128 یا 256 گیگابایت باشد."),
  RAM: number().required("رم الزامی است.").min(1, "رم باید حداقل 1 گیگابایت باشد.").max(10, "رم باید حداکثر 10 گیگابایت باشد."),
  screen: string().required("نوع صفحه نمایش الزامی است.").min(3, "نوع صفحه نمایش باید حداقل 3 کاراکتر باشد.").max(50, "نوع صفحه نمایش باید حداکثر 50 کاراکتر باشد."),
  screenSize: number().required("اندازه صفحه نمایش الزامی است.").min(1, "اندازه صفحه نمایش باید حداقل 1 اینچ باشد.").max(4, "اندازه صفحه نمایش باید حداکثر 4 اینچ باشد."),
  resolutionWidth: number().required("عرض رزولوشن الزامی است.").min(200, "عرض رزولوشن باید حداقل 200 پیکسل باشد.").max(1000, "عرض رزولوشن باید حداکثر 1000 پیکسل باشد."),
  resolutionHeight: number().required("ارتفاع رزولوشن الزامی است.").min(200, "ارتفاع رزولوشن باید حداقل 200 پیکسل باشد.").max(1000, "ارتفاع رزولوشن باید حداکثر 1000 پیکسل باشد."),
  battery: string().required("باطری الزامی است.").min(5, "باطری باید حداقل 5 کاراکتر باشد.").max(50, "باطری باید حداکثر 50 کاراکتر باشد."),
  batteryCapacity: number().required("ظرفیت باطری الزامی است.").min(200, "ظرفیت باطری باید حداقل 200 میلی‌آمپر باشد.").max(1000, "ظرفیت باطری باید حداکثر 1000 میلی‌آمپر باشد."),
  isWaterproof: boolean().required("وضعیت ضد آب الزامی است."),
});

export default validator;