import { object, string } from "yup";

const create = object({
  department: string().required("دپارتمان الزامی است.").oneOf(["مدیریت", "مالی", "پیگیری سفارش", "پشتیبانی", "بازخورد", "سایر"], "دپارتمان باید مدیریت، مالی، پیگیری سفارش، پشتیبانی، بازخورد یا سایر باشد."),
  title: string().required("عنوان الزامی است.").min(2, "عنوان باید حداقل 2 کاراکتر باشد.").max(20, "عنوان باید حداکثر 20 کاراکتر باشد."),
  body: string().required("متن الزامی است.").min(5, "متن باید حداقل 5 کاراکتر باشد.").max(300, "متن باید حداکثر 300 کاراکتر باشد."),
});

const reply = object({ body: string().required("متن الزامی است.").min(5, "متن باید حداقل 5 کاراکتر باشد.").max(300, "متن باید حداکثر 300 کاراکتر باشد.") });

export default { create, reply };