import { object, string } from "yup";

const edit = object({
  firstName: string().required("نام الزامی است.").min(3, "نام باید حداقل 3 کاراکتر باشد.").max(70, "نام باید حداکثر 70 کاراکتر باشد."),
  lastName: string().required("نام خانوادگی الزامی است.").min(4, "نام خانوادگی باید حداقل 4 کاراکتر باشد.").max(70, "نام خانوادگی باید حداکثر 70 کاراکتر باشد."),
  currentPassword: string().min(8, "رمز عبور فعلی باید حداقل 8 کاراکتر باشد.").max(20, "رمز عبور فعلی باید حداکثر 20 کاراکتر باشد.").matches(/^[\w?!$._-]{8,20}$/, "رمز عبور فعلی نامعتبر است."),
  newPassword: string().min(8, "رمز عبور جدید باید حداقل 8 کاراکتر باشد.").max(20, "رمز عبور جدید باید حداکثر 20 کاراکتر باشد.").matches(/^[\w?!$._-]{8,20}$/, "رمز عبور جدید نامعتبر است."),
});

const update = object({
  firstName: string().required("نام الزامی است.").min(3, "نام باید حداقل 3 کاراکتر باشد.").max(70, "نام باید حداکثر 70 کاراکتر باشد."),
  lastName: string().required("نام خانوادگی الزامی است.").min(4, "نام خانوادگی باید حداقل 4 کاراکتر باشد.").max(70, "نام خانوادگی باید حداکثر 70 کاراکتر باشد."),
  email: string().required("ایمیل الزامی است.").min(10, "ایمیل باید حداقل 10 کاراکتر باشد.").max(100, "ایمیل باید حداکثر 100 کاراکتر باشد.").matches(/^\w+([.-]?\w)*@\w+([.-]?\w)*\.[a-zA-Z]{2,4}$/, "ایمیل نامعتبر است."),
  password: string().min(8, "رمز عبور باید حداقل 8 کاراکتر باشد.").max(20, "رمز عبور باید حداکثر 20 کاراکتر باشد.").matches(/^[\w?!$._-]{8,20}$/, "رمز عبور نامعتبر است."),
  role: string().required("نقش الزامی است.").oneOf(["USER", "ADMIN"], "نقش باید USER یا ADMIN باشد."),
});

const cart = object({
  color: string().required("رنگ الزامی است.").matches(/^[a-fA-F\d]{24}$/, "رنگ نامعتبر است."),
});

export default { edit, update, cart };